In [2]:
# two columns: `Date` and `Profit/Losses`. 
# * Your task is to create a Python script that analyzes the records to calculate each of the following:
  #* The total number of months included in the dataset
  #* The net total amount of "Profit/Losses" over the entire period
  #* The average of the changes in "Profit/Losses" over the entire period
  #* The greatest increase in profits (date and amount) over the entire period
  #* The greatest decrease in losses (date and amount) over the entire period
  #* As an example, your analysis should look similar to the one below:

import pandas as pd

# Make a reference to the books.csv file path
df_budgetdata = "budget_data.csv"

# Import the books.csv file as a DataFrame
budgetdata = pd.read_csv(df_budgetdata)
budgetdata

        Date  Profit/Losses
0   Jan-2010         867884
1   Feb-2010         984655
2   Mar-2010         322013
3   Apr-2010         -69417
4   May-2010         310503
..       ...            ...
81  Oct-2016         102685
82  Nov-2016         795914
83  Dec-2016          60988
84  Jan-2017         138230
85  Feb-2017         671099

[86 rows x 2 columns]

In [12]:
  #* The total number of months included in the dataset
total_months = budgetdata.count()["Date"]
total_months

86

In [13]:
 #* The net total amount of "Profit/Losses" over the entire period
total_sum = budgetdata.sum()["Profit/Losses"]
total_sum

38382578

In [5]:
# sort data by "Date"
budgetdata.sort_values("Date",ascending=False)

        Date  Profit/Losses
80  Sep-2016         768450
68  Sep-2015         568529
56  Sep-2014        1166643
44  Sep-2013       -1196225
32  Sep-2012         475062
..       ...            ...
51  Apr-2014         581943
39  Apr-2013         471435
27  Apr-2012        1151518
15  Apr-2011         793163
3   Apr-2010         -69417

[86 rows x 2 columns]

In [25]:
# add new column to calculate change in profit/losses
budgetdata['Change'] = budgetdata["Profit/Losses"].diff()
budgetdata

        Date  Profit/Losses    Change
0   Jan-2010         867884       NaN
1   Feb-2010         984655  116771.0
2   Mar-2010         322013 -662642.0
3   Apr-2010         -69417 -391430.0
4   May-2010         310503  379920.0
..       ...            ...       ...
81  Oct-2016         102685 -665765.0
82  Nov-2016         795914  693229.0
83  Dec-2016          60988 -734926.0
84  Jan-2017         138230   77242.0
85  Feb-2017         671099  532869.0

[86 rows x 3 columns]

In [26]:
  #* The average of the changes in "Profit/Losses" over the entire period
change_avg = budgetdata.mean()['Change']
change_avg

-2315.1176470588234

In [27]:
 #* The greatest increase in profits (date and amount) over the entire period
change_max = budgetdata.max()['Change']
change_max

1926159.0

In [28]:
  #* The greatest decrease in losses (date and amount) over the entire period
change_min = budgetdata.min()['Change']
change_min

-2196167.0

In [40]:
max_report = budgetdata.loc[budgetdata['Change'] == change_max]
max_report

        Date  Profit/Losses     Change
25  Feb-2012        1170593  1926159.0